<a href="https://colab.research.google.com/github/lcbjrrr/quant/blob/master/Titanic_S.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# Analise de sobreviventes do Titanic

## SUMARIZACAO

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

survival        Sobreviveu ao acidente? (0 = Não; 1 = Sim)

pclass          Classe do passageiro (1 = primeira classe; 2 = segunda classe; 3 = terceira classe)

name            Nome

sex             Gênero

age             Idade

sibsp           Soma do número irmãos + cunhados + cônjuge

parch           Soma do número pais + filhos

ticket          Número da passagem

fare            Valor da passagem

cabin           Número da cabine

embarked        Porto de embarque (C = Cherbourg; Q = Queenstown; S = Southampton)

Obs: Atente que a informacao de Cabine esta presente em menos de 25% dos registros

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Genero por Classe**

In [ ]:
# Separar homens e mulheres

('Total Homens', 577)
('Total Mulheres', 314)

        Homens  Muleheres
Pclass
1          122         94
2          108         76
3          347        144

Nota-se uma proporcao de homens muito maior com relacao a mulheres na 3a classe. Existe a premissa de mulheres e criancas sao socorridas primeiro em um acidente maritimo, assim nossa analise de genero parece ter sendido. E como obter a informacao de crianca?

**Identificando Criancas**

In [ ]:
# Criar uma coluna ser maior de idade, True ou False
titanic['maior_de_idade'] = titanic['Age'] > 16 
# Separar maiores de idade
menores_de_idade = titanic[titanic['maior_de_idade']==False]
# Criar um coluna Pessoa, se menor de idade, registrar como crianca
menores_de_idade['Pessoa'] = 'crianca'
# Separar maiores de idade
maiores_de_idade = titanic[titanic['maior_de_idade']==True]
# Para os maiores, registrar o genero na coluna Pessoa
maiores_de_idade['Pessoa'] = maiores_de_idade['Sex'] 
# Rejuntar o DataFrame

('Criancas', 277)
Sex
female    212
male      402
Name: PassengerId, dtype: int64

/usr/local/lib/python2.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python2.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

In [ ]:
# Separar por classe
classe_1 = titanic[titanic['Pclass']==1]
classe_2 = titanic[titanic['Pclass']==2]
classe_3 = titanic[titanic['Pclass']==3]
# Agrupar por homem, mulher ou crianca

         1a Classe  2a Classe  3a Classe
Pessoa
crianca         39         32        206
female          79         64         69
male            98         88        216

Diferentemente do que talvez se espera-se, um numero muito grande de criancas. Possivelmente em 1912, a familias nao despendiam grandes gastos com suas criancas.

**Sobreviventes por Classe e tipo de Pessoa**

In [ ]:
# Soma da quantidade de sobrevivente por Classe:

         1a Classe  2a Classe  3a Classe
Pessoa
crianca   0.564103   0.718750   0.300971
female    0.974684   0.906250   0.420290
male      0.377551   0.068182   0.129630

Mulheres da 1a e 2a classe com uma taxa de sobrevivencia superior a 90%. Ao olharmos para 3a classe essa taxa cai por menos da metade. Vamos ver a seguir que a diferenca de preco da 2a para 3a classe nao era tao grande. As criancas da 2a classe com uma taxa de sobrevivencia maior ate que a 1a classe. Os homens de maneira geral tiveram uma taxa de sobrevivencia baixa, e sendo das classes mais baixas, 2a e 3a, ainda pior essa taxa.

**Media de Preco por Classe**

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

A 1a classe, sendo 3-4x mais cara que demais classe, dentro do esperado. A diferenca de preco entre 2a e 3a classe parece nao ser tao grande, cerca de 7 dolares. No entanto vale a atentar que a inflacao desses valores correspondem a cerca de 30x o valor ou seja estamos falando de uma diferenca de preco de 210 usd